Revit 2027 API
Family.StructuralFamilyNameKey Property
 The family's structural section shape name key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string StructuralFamilyNameKey { get; set; }
Public Property StructuralFamilyNameKey As String
	Get
	Set
public:
property String^ StructuralFamilyNameKey {
	String^ get ();
	void set (String^ value);
}
member StructuralFamilyNameKey : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace